[
  {
    "name": "Virtuous Contract",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Automatically obtained at the beginning of the game.",
    "route": "A",
    "detailedLocation": "Starts equipped with 2B during the opening sequence.",
    "extraDetails": "You do not need to search for this weapon. It is automatically equipped when you begin Route A with 2B. You cannot miss it, and it will remain in your inventory throughout all playthroughs."
  },
  {
    "name": "Cruel Oath",
    "type": "Short Sword",
    "missable": true,
    "scanner": false,
    "quest": null,
    "location": "Equipped by 9S at the beginning of Route B.",
    "route": "B",
    "detailedLocation": "Automatically acquired when you begin Route B with 9S.",
    "extraDetails": "This weapon is exclusive to 9S and is automatically equipped at the beginning of Route B. Be sure to save and hold onto it, as it's missable if overwritten or discarded before progressing into Route C."
  },
  {
    "name": "Beastbane",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Can be purchased from the Weapon Dealer in the Resistance Camp.",
    "route": "A",
    "detailedLocation": "Buy from the Resistance Camp Weapon Dealer after completing his quest.",
    "extraDetails": "Complete the Weapon Dealer’s first fetch quest early in Route A. After returning materials and unlocking his shop, Beastbane becomes available for purchase for 10,000 G. Visit the Camp again after each major mission if it doesn't appear immediately."
  },
  {
    "name": "Ancient Overlord",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Purchased from Resistance Camp vendor after progressing story.",
    "route": "A",
    "detailedLocation": "Appears in shop inventory after completing the Forest Kingdom section.",
    "extraDetails": "Return to the Resistance Camp after clearing the Forest Kingdom to see Ancient Overlord in the shop. If it’s not there, continue main story missions and revisit later. Costs around 15,000 G."
  },
  {
    "name": "Phoenix Dagger",
    "type": "Short Sword",
    "missable": false,
    "scanner": true,
    "quest": null,
    "location": "Found buried in the Desert Zone using the Scanner pod program.",
    "route": "B",
    "detailedLocation": "Use the Scanner in the desert dunes near a broken-down bus.",
    "extraDetails": "Equip the Scanner Pod Program and walk near the rocky central desert area. When the Scanner starts beeping faster, search the sand for a buried item. The Phoenix Dagger is not visible otherwise. Best done as 9S in Route B."
  },
  {
    "name": "Iron Pipe",
    "type": "Short Sword",
    "missable": true,
    "scanner": false,
    "quest": null,
    "location": "Found in the sewer tunnel between City Ruins and Amusement Park.",
    "route": "A",
    "detailedLocation": "In a pile of garbage inside the sewer tunnel near a ladder.",
    "extraDetails": "Go through the sewer that connects the City Ruins to the Amusement Park. Drop down the long ladder and look to the side where the trash is piled. The Iron Pipe is hard to see but will be glowing faintly. Make sure to collect it before progressing too far."
  },
  {
    "name": "Type-40 Sword",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": "YoRHa Betrayers",
    "location": "Reward for completing the 'YoRHa Betrayers' quest.",
    "route": "A",
    "detailedLocation": "Given by Anemone after completing the Betrayer android side quest.",
    "extraDetails": "Accept the 'YoRHa Betrayers' quest from Anemone in the Resistance Camp. You'll need to track down and defeat a pair of rogue YoRHa units. The quest has multiple combat encounters and ends with a final battle near the City Ruins. The sword is your reward."
  },
  {
    "name": "Type-3 Sword",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Buy from Devola and Popola in the Resistance Camp.",
    "route": "C",
    "detailedLocation": "Becomes available late in the game from Devola & Popola.",
    "extraDetails": "You’ll meet Devola and Popola near the Resistance Camp only during Route C. After certain main quests, their shop becomes accessible. Check frequently if you’re unsure, as some weapons only appear based on story progression."
  },
  {
    "name": "Machine Sword",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Buy from Pascal in his village.",
    "route": "A",
    "detailedLocation": "Available from Pascal's Shop after first visit to his village.",
    "extraDetails": "Visit Pascal’s Village during Route A. After your first conversation and story event, his shop becomes available inside the central house. Machine Sword costs around 10,000 G. Return later if it’s initially unavailable."
  },
  {
    "name": "Engine Blade",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Found in the Abandoned Factory during Route C.",
    "route": "C",
    "detailedLocation": "Inside a hidden chest near conveyor belts on 2nd visit.",
    "extraDetails": "Return to the Abandoned Factory during Route C. Take the right fork near the conveyor belts (early area), and look for a hidden chest behind a movable box. You’ll find the Engine Blade (a FF15 crossover weapon)."
  },
  {
    "name": "Virtuous Treaty",
    "type": "Large Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "2B's default large sword at game start.",
    "route": "A",
    "detailedLocation": "Equipped by default when 2B switches to large sword.",
    "extraDetails": "You don’t need to collect this weapon manually. Simply switch 2B’s active weapon set to include heavy attacks, and Virtuous Treaty will appear. It's present from the beginning and cannot be missed."
  },
  {
    "name": "Cruel Blood Oath",
    "type": "Large Sword",
    "missable": true,
    "scanner": false,
    "quest": null,
    "location": "Starts equipped on 9S in Route B.",
    "route": "B",
    "detailedLocation": "Given at the beginning of Route B.",
    "extraDetails": "Just like 2B’s large sword, this one is available only when you begin Route B as 9S. Equip it before progressing too far, and don’t discard it. It’s exclusive to Route B and may not appear in Route C depending on your path."
  },
  {
    "name": "Beastlord",
    "type": "Large Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Buy from Resistance Camp weapon trader.",
    "route": "A",
    "detailedLocation": "Available after unlocking the Weapon Trader’s inventory.",
    "extraDetails": "Complete the Weapon Trader’s quest and progress through Route A. Beastlord becomes available for purchase after you access the Flooded City or Amusement Park sections. Costs around 15,000 G."
  },
  {
    "name": "Iron Will",
    "type": "Large Sword",
    "missable": false,
    "scanner": false,
    "quest": "Retrieve the Confidential Intel",
    "location": "Found near the coast in the Flooded City.",
    "route": "C",
    "detailedLocation": "Part of a side quest involving data retrieval.",
    "extraDetails": "Start the quest 'Retrieve the Confidential Intel' in Route C, which becomes available from the Resistance Camp. Go to the Flooded City and follow the quest markers. The weapon is found inside a chest at the quest’s end."
  },
  {
    "name": "Phoenix Sword",
    "type": "Large Sword",
    "missable": false,
    "scanner": true,
    "quest": null,
    "location": "Buried near a waterfall in the Desert Zone.",
    "route": "B",
    "detailedLocation": "Use Scanner near rock cliffs in the desert.",
    "extraDetails": "Equip the Scanner and head toward the large rock cliffs in the Desert Zone. You’ll hear faster beeping when nearby. Use the Scanner repeatedly near the waterfall basin to reveal this buried weapon."
  },
  {
    "name": "Cypress Stick",
    "type": "Short Sword",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Found in a chest near the Forest Castle Gate.",
    "route": "A",
    "detailedLocation": "Requires jumping on multiple pillars to reach the chest.",
    "extraDetails": "To obtain the Cypress Stick, travel to the Forest Zone and locate the Forest Castle Gate. There are several pillars near the entrance. You must jump across them to reach a platform with a chest containing the weapon. The chest is hidden amongst the foliage and may take a few attempts to reach."
  },
  {
    "name": "Iron Pipe",
    "type": "Short Sword",
    "missable": true,
    "scanner": false,
    "quest": null,
    "location": "Found in the sewer tunnel between City Ruins and Amusement Park.",
    "route": "A",
    "detailedLocation": "In a pile of garbage inside the sewer tunnel near a ladder.",
    "extraDetails": "Head to the sewer tunnel connecting the City Ruins to the Amusement Park. Once inside, drop down a long ladder and look to the side where a pile of garbage is located. The Iron Pipe will glow faintly in the debris. Be sure to grab it before progressing too far through the area, as it is missable."
  },
  {
    "name": "Type-40 Fists",
    "type": "Combat Bracer",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Available from the Resistance Camp vendor.",
    "route": "A",
    "detailedLocation": "Can be purchased after unlocking the vendor's inventory.",
    "extraDetails": "To obtain the Type-40 Fists, you must visit the Resistance Camp and complete the necessary main quests. Once you have unlocked the vendor's inventory, head to the shop and purchase the weapon. It costs around 10,000 G and is available early in the game."
  },
  {
    "name": "Type-3 Fists",
    "type": "Combat Bracer",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Available from Devola and Popola in the Resistance Camp.",
    "route": "C",
    "detailedLocation": "Becomes available late in the game from Devola & Popola.",
    "extraDetails": "During Route C, you will encounter Devola and Popola in the Resistance Camp. After completing certain main story quests, they will open their shop where you can purchase the Type-3 Fists. Check their inventory after each major mission as weapons become available depending on story progression."
  },
  {
    "name": "Virtuous Grief",
    "type": "Combat Bracer",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Available from the Resistance Camp vendor.",
    "route": "A",
    "detailedLocation": "Can be purchased after unlocking the vendor's inventory.",
    "extraDetails": "The Virtuous Grief is available for purchase from the vendor at the Resistance Camp. To unlock the vendor's inventory, you will need to progress through the early main story missions. Once unlocked, visit the Resistance Camp and check the vendor's shop for this powerful combat bracer."
  },
  {
    "name": "Cruel Lament",
    "type": "Combat Bracer",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Available from the Resistance Camp vendor.",
    "route": "A",
    "detailedLocation": "Can be purchased after unlocking the vendor's inventory.",
    "extraDetails": "To acquire the Cruel Lament, visit the Resistance Camp after completing the main quests that unlock the vendor's shop. Once unlocked, head to the vendor and purchase it. The price is around 15,000 G, and it is available later in the game after progressing through various story events."
  },
  {
    "name": "Machine Heads",
    "type": "Combat Bracer",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Available from Pascal in his village.",
    "route": "A",
    "detailedLocation": "Can be purchased after visiting Pascal's village.",
    "extraDetails": "During Route A, after meeting Pascal in his village, you will gain access to his shop. You can purchase the Machine Heads from Pascal once you’ve progressed through the story and unlocked his inventory. Check Pascal's shop after visiting his village to buy this weapon."
  },
  {
    "name": "Emil Heads",
    "type": "Combat Bracer",
    "missable": false,
    "scanner": false,
    "quest": null,
    "location": "Available from the Resistance Camp vendor.",
    "route": "A",
    "detailedLocation": "Can be purchased after unlocking the vendor's inventory.",
    "extraDetails": "To acquire the Emil Heads, progress through the main story to unlock the vendor's shop at the Resistance Camp. Once unlocked, check the vendor's inventory for this item. It will cost around 10,000 G and can be purchased after completing certain story sections."
  }
]
